driver-tests/bpelse/correlation/correlationJBI/test/Feature-CorrDefSepMsg-PickInSequence/Input2.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:corr="http://xml.netbeans.org/schema/Corr-PickTest-inlineSchema">
  <soapenv:Body>
    <corr:elem>
      <corrVal2>corr1</corrVal2>
      <exCorrVal2>corr2</exCorrVal2>
      <content2>
        <id>10</id>
        <name>mesg2</name>
      </content2>
    </corr:elem>
  </soapenv:Body>
</soapenv:Envelope>